app/views/comments/_comment.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."article_id" = ?  [["article_id", 2]]
---
	<div class="col-xs-6 col-md-offset-3">
	<% if @article.comments.blank? %>