app/controllers/articles_controller.rb

  def edit
    @article = current_user.articles.find(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = $1 AND "articles"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 1]]

  def create
    @article = current_user.articles.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("body", "created_at", "excerpt", "location", "published_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @article = current_user.articles.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(article_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = $1 AND "articles"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 1]]
UPDATE "articles" SET "body" = $1, "title" = $2, "updated_at" = $3 WHERE "articles"."id" = 1  [["body", "le texte en rapport à mon article"], ["title", "Mon titre"], ["updated_at", "2015-02-06 12:20:08.114766"]]

  def notify_friend
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]