app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "hashed_password", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-02-05 16:19:28.215964"], ["email", "geoffroy@listminut.com"], ["hashed_password", "a94a8fe5ccb19ba61c4c0873d391e987982fbbd3"], ["updated_at", "2015-02-05 16:19:28.215964"]]
---
	def create
		@user = User.new(params[:user])
		if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "hashed_password" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["hashed_password", "6d3c60eeb2ddd9cce8de6c092c091ae23ffd2264"], ["updated_at", "2015-02-04 15:16:42.360269"]]
---
	def update
		@user = User.find(params[:id])
		if @user.update_attributes(params[:user])